ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR1986VK01/inc/MDR1986VK01_dma.h
}DMA_CtrlDataTypeDef;

/**
  * @brief  DMA Channel Init structure definition
  */

typedef struct
{
  DMA_CtrlDataInitTypeDef *DMA_PriCtrlData;                                             /*!< Specifies the pointer to the primary control data structure.
                                                                                            This parameter should be NULL if primary data structure is not used */
                                            
  DMA_CtrlDataInitTypeDef *DMA_AltCtrlData;                                             /*!< Specifies the pointer to the alternate control data structure.
                                                                                            This parameter should be NULL if alternate data structure is not used */
                                            
  uint32_t DMA_ProtCtrl;                                                                /*!< Specifies the AHB-Lite protection control.
                                                                                            This parameter can be a value of @ref DMA_AHB_protection_control. */
                                            
  uint8_t DMA_Priority;                                                                 /*!< Specifies the software priority for the DMA Channelx.
                                                                                            This parameter can be a value of @ref DMA_priority_level */
                                            
  uint8_t DMA_UseBurst;                                                                 /*!< Disables single request to generate DMA requests for the DMA Channelx.
                                                                                            This parameter can be a value of @ref DMA_burst_mode */
                                            
  uint8_t DMA_SelectDataStructure;                                                      /*!< Specifies the primary /alternate data structure to use by the DMA channel.
                                                                                            This parameter can be a value of @ref DMA_data_structure_selection. */

} DMA_ChannelInitTypeDef;

/**
  * @brief  DMA Channel Scatter-Gather Init structure definition
  */

typedef struct
{
  DMA_CtrlDataTypeDef *DMA_SG_TaskArray;                                                /*!< Specifies the pointer to the Scatter-Gather task structures array. The size
                                                                                            of the array should be equal to DMA_SG_TaskNumber.
                                                                                            Every structure of the array should contain the copy of the alternate control
                                                                                            data for the related task. It will be used by DMA to configure
                                                                                            the alternate control data while operating in the
                                                                                            scatter-gather mode */
                                            
  uint32_t DMA_SG_TaskNumber;                                                           /*!< Specifies the number of scatter-gather tasks to be executed by DMA */
                                            
                                            
  uint32_t DMA_SourceProtCtrl;                                                          /*!< Specifies the Primary Control Data DMA Source protection control.
                                                                                            This parameter can be a value of @ref DMA_source_protection_control. */
                                            
  uint32_t DMA_DestProtCtrl;                                                            /*!< Specifies the Primary Control Data DMA Destination protection control.
                                                                                            This parameter can be a value of @ref DMA_dest_protection_control. */
                                            
  uint32_t DMA_ProtCtrl;                                                                /*!< Specifies the AHB-Lite protection control.
                                                                                            This parameter can be a value of @ref DMA_AHB_protection_control. */
                                            
  uint8_t DMA_Priority;                                                                 /*!< Specifies the software priority for the DMA Channelx.
                                                                                            This parameter can be a value of @ref DMA_priority_level */
                                            
  uint8_t DMA_UseBurst;                                                                 /*!< Disables single request to generate DMA requests for the DMA Channelx.
                                                                                            This parameter can be a value of @ref DMA_burst_mode */

} DMA_Channel_SG_InitTypeDef;


/** @} */ /* End of group DMA_Exported_Types */

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_channels_number DMA channels number
  * @{
  */

#define IS_DMA_CHANNELS(NUMBER) ((NUMBER >= 1) && (NUMBER <= 32))

/** @} */ /* End of group DMA_channels_number */

/** @defgroup DMA_alternate_data_usage DMA alternate data usage
  * @{
  */

#define DMA_ALternateDataDisabled           ((uint16_t)(0x00))
#define DMA_ALternateDataEnabled            ((uint16_t)(0x01))

#define IS_DMA_ALTERNATE_DATA(STATE)        (((STATE) == DMA_ALternateDataDisabled) || \
                                            ((STATE)  == DMA_ALternateDataEnabled))

/** @} */ /* End of group DMA_alternate_data_usage */

/** @defgroup DMA_valid_channels DMA valid channels
  * @{
  */
/*-- req DMA request ---------------------------------------------------------*/
#define DMA_Channel_REQ_ETH0                ((uint8_t)(7))
#define DMA_Channel_REQ_ETH1                ((uint8_t)(8))
#define DMA_Channel_REQ_TIM0_0              ((uint8_t)(9))
#define DMA_Channel_REQ_TIM1_0              ((uint8_t)(10))
#define DMA_Channel_REQ_TIM2_0              ((uint8_t)(11))
#define DMA_Channel_REQ_TIM3_0              ((uint8_t)(12))
#define DMA_Channel_REQ_TIM0_1              ((uint8_t)(13))
#define DMA_Channel_REQ_TIM1_1              ((uint8_t)(14))
#define DMA_Channel_REQ_TIM2_1              ((uint8_t)(15))
#define DMA_Channel_REQ_TIM3_1              ((uint8_t)(16))
#define DMA_Channel_REQ_TIM0_2              ((uint8_t)(17))
#define DMA_Channel_REQ_TIM1_2              ((uint8_t)(18))
#define DMA_Channel_REQ_TIM2_2              ((uint8_t)(19))
#define DMA_Channel_REQ_TIM3_2              ((uint8_t)(20))
#define DMA_Channel_REQ_TIM0_3              ((uint8_t)(21))
#define DMA_Channel_REQ_TIM1_3              ((uint8_t)(22))
#define DMA_Channel_REQ_TIM2_3              ((uint8_t)(23))
#define DMA_Channel_REQ_TIM3_3              ((uint8_t)(24))
#define DMA_Channel_REQ_TIM0_4              ((uint8_t)(25))
#define DMA_Channel_REQ_TIM1_4              ((uint8_t)(26))
#define DMA_Channel_REQ_CRDC_DRQ0           ((uint8_t)(27))
#define DMA_Channel_REQ_CRDC_DRQ1           ((uint8_t)(28))
#define DMA_Channel_REQ_SSP0_TX             ((uint8_t)(29))
#define DMA_Channel_REQ_SSP1_TX             ((uint8_t)(30))
#define DMA_Channel_REQ_SSP0_RX             ((uint8_t)(31))
#define DMA_Channel_REQ_SSP1_RX             ((uint8_t)(32))
#define DMA_Channel_REQ_UART0_TX            ((uint8_t)(33))
#define DMA_Channel_REQ_UART1_TX            ((uint8_t)(34))
#define DMA_Channel_REQ_UART2_TX            ((uint8_t)(35))
#define DMA_Channel_REQ_UART3_TX            ((uint8_t)(36))
#define DMA_Channel_REQ_UART0_RX            ((uint8_t)(37))
#define DMA_Channel_REQ_UART1_RX            ((uint8_t)(38))
#define DMA_Channel_REQ_UART2_RX            ((uint8_t)(39))
#define DMA_Channel_REQ_UART3_RX            ((uint8_t)(40))
#define DMA_Channel_REQ_DAC0                ((uint8_t)(41))
#define DMA_Channel_REQ_DAC1                ((uint8_t)(42))
#define DMA_Channel_REQ_DAC2                ((uint8_t)(43))
#define DMA_Channel_REQ_DAC3                ((uint8_t)(44))
#define DMA_Channel_REQ_SHDWP_PWM9          ((uint8_t)(45))
#define DMA_Channel_REQ_SHDWP_PWM8          ((uint8_t)(46))
#define DMA_Channel_REQ_SHDWP_PWM7          ((uint8_t)(47))
#define DMA_Channel_REQ_SHDWP_PWM6          ((uint8_t)(48))
#define DMA_Channel_REQ_SHDWP_PWM5          ((uint8_t)(49))
#define DMA_Channel_REQ_SHDWP_PWM4          ((uint8_t)(50))
#define DMA_Channel_REQ_SHDWP_PWM3          ((uint8_t)(51))
#define DMA_Channel_REQ_SHDWP_PWM2          ((uint8_t)(52))
#define DMA_Channel_REQ_SHDWP_PWM1          ((uint8_t)(53))
#define DMA_Channel_REQ_SHDWB_PWM9          ((uint8_t)(54))
#define DMA_Channel_REQ_SHDWB_PWM8          ((uint8_t)(55))
#define DMA_Channel_REQ_SHDWB_PWM7          ((uint8_t)(56))
#define DMA_Channel_REQ_SHDWB_PWM6          ((uint8_t)(57))
#define DMA_Channel_REQ_SHDWB_PWM5          ((uint8_t)(58))
#define DMA_Channel_REQ_SHDWB_PWM4          ((uint8_t)(59))
#define DMA_Channel_REQ_SHDWB_PWM3          ((uint8_t)(60))
#define DMA_Channel_REQ_SHDWB_PWM2          ((uint8_t)(61))
#define DMA_Channel_REQ_SHDWB_PWM1          ((uint8_t)(62))
#define DMA_Channel_REQ_SHDWA_PWM9          ((uint8_t)(63))
#define DMA_Channel_REQ_SHDWA_PWM8          ((uint8_t)(64))
#define DMA_Channel_REQ_SHDWA_PWM7          ((uint8_t)(65))
#define DMA_Channel_REQ_SHDWA_PWM6          ((uint8_t)(66))
#define DMA_Channel_REQ_SHDWA_PWM5          ((uint8_t)(67))
#define DMA_Channel_REQ_SHDWA_PWM4          ((uint8_t)(68))
#define DMA_Channel_REQ_SHDWA_PWM3          ((uint8_t)(69))
#define DMA_Channel_REQ_SHDWA_PWM2          ((uint8_t)(70))
#define DMA_Channel_REQ_SHDWA_PWM1          ((uint8_t)(71))
#define DMA_Channel_REQ_END_CONV_ADC12      ((uint8_t)(72))
#define DMA_Channel_REQ_END_CONV_ADC11      ((uint8_t)(73))
#define DMA_Channel_REQ_END_CONV_ADC10      ((uint8_t)(74))
#define DMA_Channel_REQ_FIFO_LIM_ADC12      ((uint8_t)(75))
#define DMA_Channel_REQ_FIFO_LIM_ADC11      ((uint8_t)(76))
#define DMA_Channel_REQ_FIFO_LIM_ADC10      ((uint8_t)(77))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC12   ((uint8_t)(78))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC11   ((uint8_t)(79))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC10   ((uint8_t)(80))
#define DMA_Channel_REQ_FIFO_FULL_ADC12     ((uint8_t)(81))
#define DMA_Channel_REQ_FIFO_FULL_ADC11     ((uint8_t)(82))
#define DMA_Channel_REQ_FIFO_FULL_ADC10     ((uint8_t)(83))
#define DMA_Channel_REQ_END_CONV_ADC02      ((uint8_t)(84))
#define DMA_Channel_REQ_END_CONV_ADC01      ((uint8_t)(85))
#define DMA_Channel_REQ_END_CONV_ADC00      ((uint8_t)(86))
#define DMA_Channel_REQ_FIFO_LIM_ADC02      ((uint8_t)(87))
#define DMA_Channel_REQ_FIFO_LIM_ADC01      ((uint8_t)(88))
#define DMA_Channel_REQ_FIFO_LIM_ADC00      ((uint8_t)(89))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC02   ((uint8_t)(90))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC01   ((uint8_t)(91))
#define DMA_Channel_REQ_FIFO_NEMPTY_ADC00   ((uint8_t)(92))
#define DMA_Channel_REQ_FIFO_FULL_ADC02     ((uint8_t)(93))
#define DMA_Channel_REQ_FIFO_FULL_ADC01     ((uint8_t)(94))
#define DMA_Channel_REQ_FIFO_FULL_ADC00     ((uint8_t)(95))

